# # Практическая работа 1.3
# # Работа со списками
my_list = [] #создание пустого списка
for i in range(1, 6): #добавление эдементов с 1 до 6
    my_list.append(i)
print(my_list) # вывод списка
print(my_list[1]) #вывод второго элемента
my_list.append(6) #добавление нового числа 6
del my_list[2] #удаление 3 элемента
print(my_list) #вывод списка
print('')
# # Работа со словарями
my_dict = {} #создание пустого словаря
my_dict['name'] = 'Jhon' #добавление пары ключ значение
my_dict['age'] = 30 #добавление пары ключ значение
print('Age = ', my_dict['age']) #вывод возраста из словаря
my_dict['city'] = 'New York'#добавление новой пары key-value
my_dict['age'] = 31 #изменение значения ключа age
del my_dict['city'] #удаление ключа city
print(my_dict) #вывод словаря
print('')
# # Работа с множествами
my_set = {1, 2, 3, 4, 5, 6, 7} #формирования множества целых чисел
print(type(my_set))
my_set.add(20) #добавление нового значения
print(5 in my_set) #проверка наличия 5 в set
my_set.remove(3) #удаление одного из чисел множества
print(my_set) #вывод множества    