import socket # импорт библиотеки сокет

"""socket.socket() объект сокета, которым поддерживается тип контексного менеджера
аргументы константы - AF_INET -семейство интернет адресов для IPv4
                    - SOCK_STREAM -тип для TCP и протокол для передачи сообщений
.bind() - привязка сокета к конкретному сетевому интерфейсу и номеру порта
.listen() - прослушивает подключения
.accept() - выполнение блокируется и ожидается входящее подключение, прием новых подключений в виде кортежа((HOST, PORT))
"""

#указываем параметры создоваемого сокета, локальная связь
server = socket.socket(socket.AF_INET, socket.SOCK_STREAM)

#создает сервер на локальном адресе на свободном порту
server.bind(('127.0.0.1', 9897))

#слушаем обращения к серверу, от клиента
server.listen()

#сокет принимает адрес клиента, который будет отправлять
client, address = server.accept()

#создаем флаг, чтобы написать цикл
flag = True
#цикл
while flag:
    message = client.recv(1024).decode('utf-8') #сервер получает сообщение и декодирует его
    if message == 'quit': #если сообщение quit, то выходим из чата, если другое отпровляем его
        flag = False

    else:
        print(message)
    client.send(input('Server: ').encode('utf-8')) #отправляем сообщения клиенту и декодируем

client.close
server.close    

